module.exports = {
	up: async (queryInterface) => {
		seedData = [
			// =============== 1. ด้านการบริหารจัดการ ===============
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d1ba1",
				question: "มีการจัดประชุมครู /บุคลากร /ผู้ปกครอง และนักเรียนก่อนเปิดภาคเรียน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba1"

			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d1ba2",
				question: "มีคำสั่งการจัดชั้นเรียน และมอบหมายงานให้ครูรับผิดชอบที่ชัดเจน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba1"

			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d1ba3",
				question: "มีการวางแผน/โครงการ/มอบหมายงานให้บุคลากรตามแนวทางการพัฒนาคุณภาพการศึกษา",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba1"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d1ba4",
				question: "มีการดำเนินงานธุรการและสารสนเทศของโรงเรียนเป็นปัจจุบัน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba1"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d1ba5",
				question: "ห้องเรียน/ห้องปฏิบัติการทุกห้องมีความเรียบร้อย สะอาด ปลอดภัย และเอื้อต่อการจัดการเรียนการสอน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba1"
			},
			// =============== 2. ด้านอาคารสถานที่ ===============
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d2ba1",
				question: "มีการจัดบริเวณ/บริบทโรงเรียน/อาคารเรียนที่ปลอดภัย",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba2"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d2ba2",
				question: "มีการดูแลรักษา/ตรวจสภาพระบบไฟฟ้าที่ปลอดภัย",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba2"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d2ba3",
				question: "มีการจัดห้องเรียน โต๊ะ,เก้าอี้เรียน,ห้องธุรการ",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba2"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d2ba4",
				question: "มีการดูแลรักษาความสะอาดห้องน้ำห้องส้วม/ระบบน้ำประปาที่เหมาะสม",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba2"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d2ba5",
				question: "มีการดูแลรักษาความสะอาดห้องสมุดโรงเรียน/ห้องปฏิบัติการต่างๆ เป็นระเบียบสะอาดเรียบร้อย",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba2"
			},
			// =============== 3. ด้านครูผู้สอน ===============
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d3ba1",
				question: "มีการดำเนินงานธุรการประจำชั้นเรียนที่สมบูรณ์/เรียบร้อย",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba3"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d3ba2",
				question: "มีการเตรียมความพร้อมด้านแผนการสอนอย่างน้อย 1 สาระการเรียนรู้หลัก/ครู 1 คน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba3"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d3ba3",
				question: " มีการจัดทำตารางสอน,ตารางการจัดกิจกรรมประจำภาคเรียนที่ 2 /2565",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba3"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d3ba4",
				question: "มีการจัดกิจกรรมการเรียนรู้ตามตารางการเรียนรู้ที่เป็นปัจจุบัน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba3"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d3ba5",
				question: "มีการเรียนรู้เพื่อการสอน สอนเพื่อการเรียนรู้",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba3"
			},

			// =============== 4. ด้านการส่งเสริมการจัดการเรียนรู้ ===============
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d4ba1",
				question: "มีการยกระดับผลสัมฤทธิ์ทางการเรียน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba4"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d4ba2",
				question: " มีการพัฒนาคุณภาพผู้เรียนด้านทักษะ สมรรถนะ และคุณลักษณะตามหลักสูตร",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba4"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d4ba3",
				question: " มีการส่งเสริมการจัดการเรียนรู้ของครูโดยชุมชนทางวิชาชีพ",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba4"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d4ba4",
				question: "มีการจัดระบบประกันคุณภาพภายในสถานศึกษา",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba4"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d4ba5",
				question: "การนิเทศภายในสถานศึกษา",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba4"
			},

			// =============== 4. ด้านการส่งเสริมการจัดการเรียนรู้ ===============
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d5ba1",
				question: "การจัดเครื่องแบบนักเรียน และอุปกรณ์การเรียน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba5"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d5ba2",
				question: "มีการจัดกิจกรรมพัฒนาผู้เรียน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba5"
			},
			{
				id: "e56263e9-cd10-4bd8-b040-ff550a0d5ba3",
				question: "มีหนังสือเรียนเพียงพอกับนักเรียน",
				rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d5ba5"
			},



				// =============== ตอนที่ 3 รายการนิเทศ ติดตาม การดำเนินงานตามนโยบายของหน่วยงานต้นสังกัด ===============
				// 1. ด้านนโยบายการจัดการศึกษาของกระทรวงศึกษาธิการ
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda1e01",
					question: "มีการเตรียมความพร้อมจัดหลักสูตรฐานสมรรถนะ",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba1"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda1e02",
					question: "มีการพัฒนาทักษะทางอาชีพ",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba1"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda1e03",
					question: "มีการจัดการศึกษาสำหรับผู้ที่มีความต้องการจำเป็นพิเศษ",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba1"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda1e04",
					question: "มีการจัดเรียนการสอนออนไลน์ด้วยการนำนวัตกรรมและ เทคโนโลยีที่ทันสมัยมาใช้",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba1"
				},
				// 2. ด้านนโยบายการจัดการศึกษาของสำนักงานคณะกรรมการขั้นพื้นฐาน
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda2e01",
					question: "มีการพัฒนาการอ่านออกเขียนได้ของผู้เรียน",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba2"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda2e02",
					question: "มีการพัฒนาทักษะ คณิตศาสตร์ การคิดวิเคราะห์ การคิดขั้นสูงนวัตกรรมวิทยาศาสตร์และเทคโนโลยีดิจิทัล และวิทยาการคำนวณ",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba2"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda2e03",
					question: "มีการพัฒนาทักษะภาษาอังกฤษ",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba2"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda2e04",
					question: "มีการเตรียมผู้เรียนให้มีทักษะที่จำเป็นในศตวรรษที่ 21",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba2"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda2e05",
					question: "มีการจัดการศึกษาสำหรับผู้ที่มีความต้องการจำเป็นพิเศษ",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba2"
				},
				// 3. ด้านนโยบายและมาตรการความปลอดภัยของผู้เรียน
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda3e01",
					question: "มีการเตรียมผู้เรียนให้มีความตะหนักถึงความปลอดภัยทางร่างกาย และจิตใจ",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba3"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda3e02",
					question: "มีการสำรวจจัดทำแผนเพื่อให้เกิดความปลอดภัยแก่ผู้เรียน",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba3"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda3e03",
					question: "มีการสำรวจอาคารสถานที่เพื่อให้เกิดความปลอดภัยในการจัด กิจกรรมการเรียนแก่ผู้เรียน",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba3"
				},
				{
					id: "e42f2e98-aec0-48ae-a6e0-586e0bda3e04",
					question: "มีการแต่งตั้งครูเวรประจำวันคอยควบคุม กำกับ ติดตามดูแลการรักษาความปลอดภัยตลอดทั้งวัน",
					rsf_section_id: "e46263e9-cd10-4bd8-b040-ff550a0d2ba3"
				},
		]
		await queryInterface.bulkInsert('rsf_question', seedData)
	},

	down: async (queryInterface) => {
		await queryInterface.bulkDelete('rsf_question', {});
	}
}