module.exports = {
	up: async (queryInterface) => {
		seedData = [
			// ตอนที่  1  การตรวจสอบองค์ประกอบของหลักสูตรสถานศึกษา : กรอบสาระท้องถิ่น  มาตรฐานสากล จุดเน้นการจัดการศึกษาเพื่อการมีงานทำ 
			{
				id: "098609d2-8f37-44ff-b6d0-000003c00001",
				priority: "3.1",
				question: "3.1  มีการระบุรหัสวิชา ชื่อรายวิชา และชื่อกลุ่มสาระการเรียนรู้ไว้อย่างถูกต้องชัดเจน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00003"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000003c00002",
				priority: "3.2",
				question: "3.2  มีการระบุชั้นปี/ภาคเรียนที่สอน (ระดับมัธยมศึกษา) และจำนวนเวลาเรียนและ / หรือหน่วยกิต  ไว้อย่างถูกต้องชัดเจน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00003"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000003c00003",
				priority: "3.3",
				question: "3.3 การเขียนคำอธิบายรายวิชาเขียนเป็นความเรียง โดยระบุองค์ความรู้ทักษะกระบวนการและคุณลักษณะหรือเจตคติที่ต้องการ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00003"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000003c00004",
				priority: "3.4",
				question: "3.4  มีการจัดทำคำอธิบายรายวิชาพื้นฐานครอบคลุมตัวชี้วัด สาระการเรียนรู้แกนกลาง",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00003"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000003c00005",
				priority: "3.5",
				question: "3.5 มีการระบุรหัสตัวชี้วัด ในรายวิชาพื้นฐาน และจำนวนรวมของตัวชี้วัด",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00003"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000003c00006",
				priority: "3.6",
				question: "3.6 มีการระบุผลการเรียนรู้ ในรายวิชาเพิ่มเติม และจำนวนรวมของผลการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00003"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000003c00007",
				priority: "3.7",
				question: "3.7 มีการกำหนดสาระการเรียนรู้ท้องถิ่นสอดแทรกอยู่ในคำอธิบายรายวิชาพื้นฐาน หรือรายวิชาเพิ่มเติม",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00003"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000004c00001",
				priority: "4.1",
				question: "4.1  จัดกิจกรรมทั้ง  3  กิจกรรม  (กิจกรรมแนะแนว กิจกรรมนักเรียน และกิจกรรมเพื่อสังคมและสาธารณประโยชน์) ตามที่กำหนดไว้ในหลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช  2551",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00004"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000004c00002",
				priority: "4.2",
				question: "4.2  จัดเวลาเรียนกิจกรรมพัฒนาผู้เรียน สอดคล้องกับโครงสร้างเวลาเรียนที่หลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน  พุทธศักราช  2551",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00004"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000004c00003",
				priority: "4.3",
				question: "4.3  มีแนวทางการจัดกิจกรรมพัฒนาผู้เรียนที่ชัดเจนทุกกิจกรรม",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00004"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000004c00004",
				priority: "4.4",
				question: "4.4  มีแนวทางการประเมินผลกิจกรรมพัฒนาผู้เรียนที่ชัดเจนสอดคล้องกับแนวทางการจัดกิจกรรมพัฒนาผู้เรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00004"
			},

			{
				id: "098609d2-8f37-44ff-b6d0-000005c00001",
				priority: "5.1",
				question: "5.1  มีการระบุเวลาเรียน/หน่วยกิต รายวิชาพื้นฐานและรายวิชาเพิ่มเติมอย่างชัดเจนสอดคล้องกับโครงสร้างหลักสูตรของโรงเรียน สอดคล้องกับเกณฑ์การจบการศึกษา ตามหลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช  2551 ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00005"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000005c00002",
				priority: "5.2",
				question: "5.2  มีการระบุเกณฑ์การประเมินการอ่านคิด วิเคราะห์ และเขียน ไว้อย่างชัดเจน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00005"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000005c00003",
				priority: "5.3",
				question: "5.3  มีการระบุเกณฑ์การประเมินคุณลักษณะอันพึงประสงค์ไว้อย่างชัดเจน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00005"
			},
			{
				id: "098609d2-8f37-44ff-b6d0-000005c00004",
				priority: "5.4",
				question: "5.4  มีการระบุเกณฑ์การผ่านกิจกรรมพัฒนาผู้เรียน ไว้อย่างชัดเจน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d8-000001c00005"
			},

			// แบบตรวจสอบการพัฒนาหลักสูตรสถานศึกษา : กรอบสาระท้องถิ่น มาตรฐานสากล จุดเน้นการจัดการศึกษาเพื่อการมีงานทำ
			// =============== 1. ส่วนนำ ===============
			{
				id: "098609d2-8f37-12ff-b6d0-000001c00001",
				priority: "1.1",
				question: "1. มีการระบุรหัสวิชา ชื่อรายวิชา กลุ่มสาระการเรียนรู้ ระดับชั้น จำนวนชั่วโมงและ/หรือหน่วยกิตอย่างครบถ้วน ชัดเจน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000001c00002",
				priority: "1.2",
				question: "2. ชื่อหน่วยการเรียนรู้ น่าสนใจ กะทัดรัด ชัดเจน สอดคล้องกับสาระสำคัญ/ความคิดรวบยอด",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000001c00003",
				priority: "1.3",
				question: "3. การจัดกลุ่มตัวชี้วัด/ผลการเรียนรู้ ในแต่ละหน่วยการเรียนรู้มีความสัมพันธ์เชื่อมโยงและสามารถจัดการเรียนรู้ร่วมกันได้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000001c00004",
				priority: "1.4",
				question: "4. สาระสำคัญ/ความคิดรวบยอด แสดงให้เห็นแก่นความรู้รวมถึงสาระการเรียนรู้ของตัวชี้วัด/ผลการเรียนรู้ในแต่ละหน่วยการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000001c00005",
				priority: "1.5",
				question: "5. เวลาเรียน ในแต่ละหน่วยการเรียนรู้เหมาะสมกับจำนวนตัวชี้วัด/ ผลการเรียนรู้ ความยากง่ายของสาระสำคัญ และกระบวนการเรียนรู้ที่จะใช้ในการพัฒนาผู้เรียนตามตัวชี้วัด/ผลการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000001c00006",
				priority: "1.6",
				question: "6. น้ำหนัก/สัดส่วนของคะแนน  เหมาะสมกับเวลาเรียน ความยากง่ายของสาระสำคัญ และกระบวนการเรียนรู้ที่จะใช้ในการพัฒนาผู้เรียนตามตัวชี้วัด/ผลการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000001c00007",
				priority: "1.7",
				question: "7. ชิ้นงาน/ภาระงานรวบยอด สอดคล้อง สัมพันธ์ ครอบคลุม และสะท้อนให้เห็นผลการพัฒนาผู้เรียนตามตัวชี้วัด/ผลการเรียนรู้ในแต่ละหน่วยการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00001",
				priority: "2.1",
				question: " 1. มีการระบุรหัสวิชา ชื่อรายวิชา กลุ่มสาระการเรียนรู้ ระดับชั้น จำนวนชั่วโมงและชื่อหน่วยเรียนรู้อย่างครบถ้วน ชัดเจนและสอดคล้องกับโครงสร้างรายวิชา",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00002",
				priority: "2.2",
				question: "2. มาตรฐานการเรียนรู้ / ตัวชี้วัด / ผลการเรียนรู้ สมรรถนะสำคัญและคุณลักษณะอันพึงประสงค์มีความสัมพันธ์ เชื่อมโยงกัน ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00003",
				priority: "2.3",
				question: "3. สาระสำคัญ / ความคิดรวบยอด มีความถูกต้อง สอดคล้อง และครอบคลุมมาตรฐาน/ตัวชี้วัด/ผลการเรียนรู้  ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00004",
				priority: "2.4",
				question: "4. สาระการเรียนรู้  มีความถูกต้อง และสอดคล้องกับมาตรฐาน /ตัวชี้วัด / ผลการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00005",
				priority: "2.5",
				question: "5. หลักฐานการเรียนรู้ (ชิ้นงาน / ภาระงาน) สอดคล้องกับมาตรฐานการเรียนรู้ / ตัวชี้วัด / ผลการเรียนรู้ การวัดและประเมินผล  และกิจกรรมการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00006",
				priority: "2.6",
				question: "6. การวัดและประเมินผล",
				type: "BOOLEAN",
				detail: "- เป็นการประเมินตามสภาพจริงใช้วิธีการที่หลากหลาย สอดคล้องกับมาตรฐานการเรียนรู้ / ตัวชี้วัด/ผลการเรียนรู้ และกิจกรรมการเรียนรู้ - ระบุวิธีการ เครื่องมือและเกณฑ์การประเมินที่สะท้อน คุณภาพผู้เรียนตามมาตรฐานการเรียนรู้ / ตัวชี้วัด/ผลการเรียนรู้",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00007",
				priority: "2.7",
				question: "7. กิจกรรมการเรียนรู้ ",
				type: "BOOLEAN",
				detail: "- เป็นการประเมินตามสภาพจริงใช้วิธีการที่หลากหลาย สอดคล้องกับมาตรฐานการเรียนรู้ / ตัวชี้วัด/ผลการเรียนรู้ และกิจกรรมการเรียนรู้ - ระบุวิธีการ เครื่องมือและเกณฑ์การประเมินที่สะท้อน คุณภาพผู้เรียนตามมาตรฐานการเรียนรู้ / ตัวชี้วัด/ผลการเรียนรู้",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000002c00008",
				priority: "2.8",
				question: "8.  สื่อและแหล่งเรียนรู้  มีความเหมาะสมกับกิจกรรมการเรียนรู้ของผู้เรียน และเวลา ช่วยให้ผู้เรียนเกิดการเรียนรู้ได้ดีและรวดเร็วขึ้น",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00002"
			},

			{
				id: "098609d2-8f37-12ff-b6d0-000003c00001",
				priority: "3.1",
				question: "1. มีการระบุชื่อแผนการเรียนรู้ ชื่อหน่วยการเรียนรู้ รหัสวิชา ชื่อรายวิชา กลุ่มสาระการเรียนรู้ ระดับชั้น จำนวนชั่วโมงอย่างครบถ้วน ชัดเจน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00002",
				priority: "3.2",
				question: "2. ชื่อแผนจัดการเรียนรู้ น่าสนใจ กะทัดรัด ชัดเจน สอดคล้องกับสาระสำคัญ / ความคิดรวบยอด",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00003",
				priority: "3.3",
				question: "3.  มาตรฐานการเรียนรู้/ตัวชี้วัด/ผลการเรียนรู้   ทักษะ /กระบวนการ / สมรรถนะสำคัญและคุณลักษณะอันพึงประสงค์ มีความสอดคล้องกัน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00004",
				priority: "3.4",
				question: "4.  มาตรฐาน / ตัวชี้วัด/ผลการเรียนรู้ / จุดประสงค์การเรียนรู้ สาระสำคัญ / ความคิดรวบยอด สาระการเรียนรู้ และกิจกรรมการเรียนรู้มีความสอดคล้องกัน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00005",
				priority: "3.5",
				question: "5.  มาตรฐาน / ตัวชี้วัด / ผลการเรียนรู้ / จุดประสงค์การเรียนรู้ ครอบคลุมการพัฒนานักเรียนในด้านความรู้และ / หรือทักษะกระบวนการ และ / หรือคุณลักษณะ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00006",
				priority: "3.6",
				question: "6.  มาตรฐาน / ตัวชี้วัด / ผลการเรียนรู้ / จุดประสงค์การเรียนรู้ มีความเหมาะสมกับเวลา สาระการเรียนรู้ วัย และพื้นฐานของผู้เรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00007",
				priority: "3.7",
				question: "7. มาตรฐาน / ตัวชี้วัด / ผลการเรียนรู้ / จุดประสงค์การเรียนรู้ ระบุพฤติกรรมการเรียนรู้ที่คาดหวังในรูปของการแสดงออก หรือการกระทำที่สามารถวัดและประเมินผลได้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00008",
				priority: "3.8",
				question: "8. สาระสำคัญ / ความคิดรวบยอดมีความถูกต้อง ชัดเจน กะทัดรัด  ครอบคลุมประเด็นสำคัญของสาระการเรียนรู้",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00009",
				priority: "3.9",
				question: "9. สาระการเรียนรู้เหมาะสมกับเวลา วัย ระดับชั้น และพื้นฐานของผู้เรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00010",
				priority: "3.10",
				question: "10.  สาระการเรียนรู้มีการจัดลำดับความยากง่าย และความต่อเนื่องของเนื้อหาสาระอย่างเหมาะสม / มีการจัดเนื้อหาสาระให้สัมพันธ์กันในลักษณะบูรณาการ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00011",
				priority: "3.11",
				question: "11.  สาระการเรียนรู้มีความถูกต้อง ทันสมัย เป็นสิ่งจำเป็นและเป็นประโยชน์ต่อผู้เรียน เป็นพื้นฐานในการสร้างข้อความรู้ใหม่หรือทักษะที่ต้องการ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00012",
				priority: "3.12",
				question: "12.  หลักฐานการเรียนรู้",
				type: "BOOLEAN",
				detail: "(ชิ้นงาน/ภาระงาน) ที่กำหนดสอดคล้องกับมาตรฐานการเรียนรู้ / ตัวชี้วัด / ผลการเรียนรู้ / จุดประสงค์ การเรียนรู้  การวัดและประเมินผล  และกิจกรรมการเรียนรู้",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00013",
				priority: "3.13",
				question: "13.  หลักฐานการเรียนรู้ (ชิ้นงาน / ภาระงานที่กำหนด) สามารถนำพาให้ผู้เรียนสร้างสรรค์ชิ้นงานหรือ ภาระงานรวบยอดได้อย่างมีประสิทธิภาพ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00014",
				priority: "3.14",
				question: "14.  มีการระบุวิธีการ เครื่องมือการวัดและประเมินผล และเกณฑ์การประเมินที่สอดคล้องกับมาตรฐานการเรียนรู้",
				type: "BOOLEAN",
				detail: "/ ตัวชี้วัด / ผลการเรียนรู้ / จุดประสงค์การเรียนรู้และกิจกรรมการเรียนรู้",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00015",
				priority: "3.15",
				question: "15.  มีวิธีการวัดและประเมินผลที่หลากหลายและผู้เรียนมีส่วนร่วมในการประเมิน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00016",
				priority: "3.16",
				question: "16.  กิจกรรมการเรียนรู้มีความหลากหลาย โดยใช้ทักษะกระบวนการ เรียนรู้ตามธรรมชาติของวิชา และเปิดโอกาสให้ผู้เรียนมีส่วนร่วมในกิจกรรมอย่างทั่วถึง",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00017",
				priority: "3.17",
				question: " 17. กิจกรรมการเรียนรู้สามารถนำผู้เรียนให้บรรลุจุดประสงค์การเรียนรู้ที่กำหนดไว้ได้อย่างเหมาะสมและมีประสิทธิภาพ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00018",
				priority: "3.18",
				question: "18. กิจกรรมการเรียนรู้สามารถนำพาให้ผู้เรียนสร้างสรรค์ชิ้นงานหรือภาระงานที่กำหนดไว้ได้อย่างมีประสิทธิภาพ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00019",
				priority: "3.19",
				question: "19. สื่อและแหล่งการเรียนรู้ที่กำหนด มีความเหมาะสมกับกิจกรรมการเรียนรู้  ผู้เรียน และเวลา และช่วยให้ผู้เรียนเกิดการเรียนรู้ได้ดี และรวดเร็วขึ้น",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d0-000003c00020",
				priority: "3.20",
				question: "20.  มีบันทึกหลังการสอนที่สะท้อนผลการจัดกิจกรรม พฤติกรรมการเรียนรู้ของผู้เรียน อุปสรรค/ปัญหา/ปัจจัยที่มีผลต่อการจัดกิจกรรม รวมทั้งแนวทางในการแก้ไขปรับปรุงการสอนให้ดีขึ้น",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000002c00003"
			},

			// 1.3  แบบนิเทศ ติดตามการจัดการเรียนการสอนรายวิชาวิทยาการคำนวณ ออกแบบเทคโนโลยี และรายวิชาเกี่ยวข้องกับหุ่นยนต์
			{
				id: "098609d2-8f37-12ff-b6d1-300000c10001",
				priority: "1.1",
				question: "1. ดำเนินการจัดทำโครงสร้างเวลาเรียน และคำอธิบายรายวิชา ตามหลักสูตรแกนกลาง 2551 ฉบับปรับปรุง  2560",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c10002",
				priority: "1.2",
				question: "2. ดำเนินการจัดทำแผนการจัดการเรียนรู้รายวิชา",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c10003",
				priority: "1.3",
				question: "3. ดำเนินการเก็บรวบรวม และสรุปผลที่เกิดจากการจัดการเรียนรู้ในชั้นเรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c10004",
				priority: "1.4",
				question: "4. ดำเนินการเก็บรวบรวม และสรุปผลที่เกิดจากการจัดการเรียนรู้กับผู้เรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c10005",
				priority: "1.5",
				question: "5. โรงเรียนมีรายวิชาที่เกี่ยวข้องหรือมีเนื้อหาที่สอดคล้องกับรายวิชาวิทยาการคำนวณ ก่อนปีการศึกษา  2565 มาก่อน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c20001",
				priority: "2.1",
				question: "1. ดำเนินการจัดทำโครงสร้างเวลาเรียน และคำอธิบายรายวิชา ตามหลักสูตรแกนกลาง 2551  ฉบับปรับปรุง  2560 ",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c20002",
				priority: "2.2",
				question: "2. ดำเนินการจัดทำแผนการจัดการเรียนรู้รายวิชา",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c20003",
				priority: "2.3",
				question: "3. ดำเนินการเก็บรวบรวม และสรุปผลที่เกิดจากการจัดการเรียนรู้ในชั้นเรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c20004",
				priority: "2.4",
				question: "4. ดำเนินการเก็บรวบรวม และสรุปผลที่เกิดจากการจัดการเรียนรู้กับผู้เรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c20005",
				priority: "2.5",
				question: "5. โรงเรียนมีรายวิชาที่เกี่ยวข้องหรือมีเนื้อหาที่สอดคล้องกับรายวิชาออกแบบเทคโนโลยี ก่อนปีการศึกษา  2565   มาก่อนแล้ว",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c20006",
				priority: "2.6",
				question: "6. ดำเนินการจัดการเรียนรู้ออกแบบเทคโนโลยีบูรณาการเทคโนโลยีหุ่นยนต์",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00002"
			},

			{
				id: "098609d2-8f37-12ff-b6d1-300000c30001",
				priority: "3.1",
				question: "1. ดำเนินการจัดทำโครงสร้างเวลาเรียน  และคำอธิบายรายวิชา ตามหลักสูตรแกนกลาง 2551 (ฉบับปรับปรุง2560)",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c30002",
				priority: "3.2",
				question: "2. ดำเนินการจัดทำแผนการจัดการเรียนรู้รายวิชา",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c30003",
				priority: "3.3",
				question: "3. ดำเนินการเก็บรวบรวม และสรุปผลที่เกิดจากการจัดการเรียนรู้ในชั้นเรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c30004",
				priority: "3.4",
				question: "4. ดำเนินการเก็บรวบรวม และสรุปผลที่เกิดจากการจัดการเรียนรู้กับผู้เรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c30005",
				priority: "3.5",
				question: "5. โรงเรียนมีรายวิชาที่เกี่ยวข้องหรือมีเนื้อหาที่สอดคล้องกับรายวิชาการสร้างพัฒนา ออกแบบหุ่นยนต์ ก่อนปีการศึกษา 2565 มาก่อนแล้ว",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-300000c30006",
				priority: "3.6",
				question: "6. ดำเนินการจัดการเรียนรู้ ที่มีการบูรณาการวิทยาการคำนวณ ออกแบบเทคโนโลยี และบูรณาการเทคโนโลยีหุ่นยนต์",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000003c00003"
			},

			// 1.4  แบบนิเทศ ติดตาม การขับเคลื่อนการจัดการเรียนรู้ตามแนวคิดสะเต็มศึกษา (STEM Education) 
			{
				id: "098609d2-8f37-12ff-b6d1-400000c10001",
				priority: "1.1",
				question: "ชื่อ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c10002",
				priority: "1.2",
				question: "ตำแหน่ง",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c10003",
				priority: "1.3",
				question: "E-mail",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c10004",
				priority: "1.4",
				question: "โทรศัพท์",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00001"
			},

			{
				id: "098609d2-8f37-12ff-b6d1-400000c20001",
				priority: "2.1",
				question: "2.1  โรงเรียนได้มีการแต่งตั้งคณะกรรมการ / ผู้รับผิดชอบในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) หรือไม่",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c20002",
				priority: "2.2",
				question: "2.2  โรงเรียนได้มีการทำความร่วมมือ (MOU) หรือได้รับความร่วมมือจากหน่วยงานต่างๆ ทั้งภาครัฐ  และเอกชน เพื่อขับเคลื่อนการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) ของโรงเรียนหรือไม่",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c20003",
				priority: "2.3",
				question: "2.3  โรงเรียนได้มีการเชิญทูตสะเต็ม มาเข้าร่วมกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) ของโรงเรียนหรือไม่",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c20004",
				priority: "2.4",
				question: "2.4  โรงเรียนได้มีการนำประเด็นเรื่อง การจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) เป็นส่วนหนึ่งของแผนงานประจำปีและโครงการของโรงเรียนโดยกำหนดตัวชี้วัดภาพความสำเร็จอย่างชัดเจนหรือไม่",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c30001",
				priority: "3.1",
				question: "3.1 โรงเรียนมีการส่งเสริมและสนับสนุนให้ครูเข้ารับการอบรมเกี่ยวกับการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) หรือไม่ อย่างไร",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c30002",
				priority: "3.2",
				question: "3.2 โรงเรียนมีการส่งเสริมและสนับสนุนให้ครูในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) ผ่านการเข้าร่วมชุมชนการเรียนรู้ทางวิชาชีพ (PLC) หรือไม่ อย่างไร",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c30003",
				priority: "3.3",
				question: "3.3 โรงเรียนมีกระบวนการนิเทศการสอนของครูในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) หรือไม่ อย่างไร",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c30004",
				priority: "3.4",
				question: "3.4 โรงเรียนมีการให้รางวัล ยกย่อง เชิดชูเกียรติแก่ครูที่มีผลงานดีเด่นในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) หรือไม่  อย่างไร",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c60001",
				priority: "6.1",
				question: "6.1 มีผลงานที่เกิดขึ้นกับโรงเรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00006"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c60002",
				priority: "6.2",
				question: "6.2 มีผลงานที่เกิดขึ้นกับผู้บริหาร/ครู",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00006"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c60003",
				priority: "6.3",
				question: "6.3 มีผลงานที่เกิดขึ้นกับนักเรียน",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00006"
			},
			// 7. ด้านปัญหาและความต้องการของโรงเรียนในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education)   
			{
				id: "098609d2-8f37-12ff-b6d1-400000c70001",
				priority: "7.1",
				question: "7.1 ปัญหาและอุปสรรคของโรงเรียนในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education)",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00007"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c70002",
				priority: "7.2",
				question: "7.2 ความต้องการของโรงเรียนในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education)",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00007"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-400000c70003",
				priority: "7.3",
				question: "7.3 ความต้องการของโรงเรียนในการจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education)",
				type: "BOOLEAN",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-000004c00007"
			},
		

			// 1.6  แบบนิเทศ ติดตาม การจัดกิจกรรมการเรียนรู้แบบ Active Learning
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10001",
				priority: "1",
				question: "1. สร้างบรรยากาศการเรียนรู้แบบมีส่วนร่วม",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10002",
				priority: "2",
				question: "2. สร้างแรงจูงใจจากตัวอย่าง เหตุการณ์ และสถานการณ์ที่น่าสนใจ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10003",
				priority: "3",
				question: "3. สร้างแรงจูงใจให้ผู้เรียนได้เรียนรู้จากการลงมือปฏิบัติจริง ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10004",
				priority: "4",
				question: "4. ฝึกให้มีการนำเสนอผลงาน และยอมรับแนวคิดจากผู้อื่น",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10005",
				priority: "5",
				question: "5. แบ่งกลุ่มการทำงาน หรือฝึกให้ทำงานเป็นทีม",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10006",
				priority: "6",
				question: "6. จัดกิจกรรมการเรียนรู้ที่สอดคล้องกับมาตรฐาน และตัวชี้วัด ตามหลักสูตรแกนกลาง",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10007",
				priority: "7",
				question: "7. สร้างแรงจูงใจ และแรงบันดาลใจแก่ผู้เรียน โดยการกำหนดโจทย์ เงื่อนไข สถานการณ์ ที่น่าสนใจและท้าทาย",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10008",
				priority: "8",
				question: "8. ฝึกให้ผู้เรียนได้ปฏิบัติงานจากสถานการณ์จำลองและสถานการณ์จริง",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10009",
				priority: "9",
				question: "9. มีการวัดประเมินผลในรูปแบบที่หลากหลาย ทั้งก่อนเรียน ระหว่างเรียน และหลังเรียน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10010",
				priority: "10",
				question: "10. มีการประยุกต์ใช้สื่อ นวัตกรรมและเทคโนโลยี กับการจัดกิจกรรมเพื่อกระตุ้นความความสามารถและสร้างทักษะแก่ผู้เรียน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10011",
				priority: "11",
				question: "11. ใจกว้าง ยอมรับในความสามารถ การแสดงออก และความคิดเห็น ของที่ผู้เรียน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c10012",
				priority: "12",
				question: "12. วางแผนเกี่ยวกับเวลาในการจัดกิจกรรมการเรียนรู้อย่างชัดเจน ทั้งในส่วนของเนื้อหา และกิจกรรม",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00001"
			},
			
			{
				id: "098609d2-8f37-12ff-b6d1-600000c20001",
				priority: "13",
				question: "13. ผู้เรียนสร้างองค์ความรู้และจัดระบบการเรียนรู้ด้วยตนเอง",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c20002",
				priority: "14",
				question: "14. ผู้เรียนมีส่วนร่วมในกิจกรรมการเรียนการสอน ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c20003",
				priority: "15",
				question: "15. ผู้เรียนมีความกระตือรือร้นในการเรียนรู้",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c20004",
				priority: "16",
				question: "16. ผู้เรียนมีปฏิสัมพันธ์ที่ดีกับผู้สอนและเพื่อนในชั้นเรียน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c20005",
				priority: "17",
				question: "17. ผู้เรียนกล้านำเสนอและแสดงความคิดเห็น และโต้แย้งอย่างมีเหตุผล",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c20006",
				priority: "18",
				question: "18. ผู้เรียนมีความรับผิดชอบ สามารถทำกิจกรรมจนสำเร็จลุล่วง",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00002"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c20007",
				priority: "19",
				question: "19. ผู้เรียนร่วมกันจัดเก็บ ทำความสะอาดอุปกรณ์และสถานที่หลังการปฏิบัติกิจกรรม",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00002"
			},

			{
				id: "098609d2-8f37-12ff-b6d1-600000c30001",
				priority: "20",
				question: "20. เป็นกิจกรรมที่ให้ผู้เรียนมีส่วนร่วมในการเรียนรู้",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00003"
			},
			
			{
				id: "098609d2-8f37-12ff-b6d1-600000c30002",
				priority: "21",
				question: "21. เป็นกิจกรรมการเรียนรู้ที่เน้นให้ผู้เรียนฝึกทักษะการอ่าน การฟัง การพูดและการคิด เช่น การคิดวิเคราะห์ คิดสังเคราะห์ คิดสร้างสรรค์ ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c30003",
				priority: "22",
				question: "22. เป็นกิจกรรมที่สร้างสถานการณ์ให้ผู้เรียนได้ลงมือปฏิบัติจริง ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c30004",
				priority: "23",
				question: "23. เป็นกิจกรรมที่เปิดโอกาสให้ผู้เรียนบูรณาการข้อมูล, ข่าวสาร, สารสนเทศ, และหลักการสู่การสร้างความคิดรวบยอด",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00003"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-600000c30005",
				priority: "24",
				question: "24. เป็นกิจกรรมที่มีการสร้างองค์ความรู้ ทั้งจากการปฏิบัติ จากประสบการณ์ และจากการสรุปทบทวนของผู้เรียน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-500001c00003"
			},

			{
				id: "098609d2-8f37-12ff-b6d1-700000c10001",
				priority: "1",
				question: "1. จัดทำคำสั่งแต่งตั้งคณะกรรมการขับเคลื่อนกระบวนการ PPLC (Piboon Professional Learning Community) ระดับสถานศึกษา",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c10002",
				priority: "2",
				question: "2. การกำหนดบทบาทหน้าที่คณะกรรมการขับเคลื่อนกระบวนการ PPLC (Piboon Professional Learning Community) ที่ชัดเจน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c20001",
				priority: "3",
				question: "1. การจัดทำแผนงานการขับเคลื่อนกระบวนการ  PPLC (Piboon Professional Learning Community)ระดับสถานศึกษา",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c20002",
				priority: "4",
				question: "2. การสร้างทีมงาน  PPLC (Piboon Professional Learning Community)ระดับกลุ่มสาระ/ ช่วงชั้น/ ระดับชั้น",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c20003",
				priority: "5",
				question: "3. การสร้างเครือข่ายกับหน่วยงานอื่น (เช่น มหาวิทยาลัย/หน่วยงานเอกชน/อื่นๆ) พร้อมระบุว่าเข้ามาสนับสนุนเรื่องใดบ้าง",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c30001",
				priority: "6",
				question: "1. การกำหนดชั่วโมงในกระบวนการ  PPLC (Piboon Professional Learning Community) โดยแยกตามทีมงาน PPLC แต่ละกลุ่มที่ปฏิบัติจริง",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c30002",
				priority: "7",
				question: "2. การสร้างความตระหนัก/ความรู้ความเข้าใจ และแนวทางของกระบวนการ PPLC ให้กับบุคลากรในสถานศึกษา",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c30003",
				priority: "8",
				question: "3. การกำหนดเป้าหมายในการจัดการเรียนรู้ร่วมกัน (อาจมีมากกว่า 1 ข้อ ตามบริบทของแต่ละกลุ่ม แต่ยังคงตอบสนองนโยบายของสถานศึกษา)",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c30004",
				priority: "9",
				question: "4. การนำกระบวนการ PPLC เข้าสู่ห้องเรียน (การพูดคุยประเด็นก่อนการเข้าสอน / ก่อนนำแผนการจัดการเรียนรู้เพื่อนำไปสอนในห้องเรียน  การสังเกตการสอน การสะท้อนผลหลังสอน)",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c30005",
				priority: "10",
				question: "5. การนำกระบวนการ PPLC มาจัดทำวิจัยในชั้นเรียน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},

			{
				id: "098609d2-8f37-12ff-b6d1-700000c40001",
				priority: "11",
				question: "1. ภาษาไทย",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40002",
				priority: "12",
				question: "2. ภาษาต่างประเทศ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40003",
				priority: "13",
				question: "3. คณิตศาสตร์",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40004",
				priority: "14",
				question: "4. วิทยาศาสตร์",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40005",
				priority: "15",
				question: "5. สังคมศึกษา ศาสนาและวัฒนธรรม",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40006",
				priority: "16",
				question: "6. สุขศึกษาและพลศึกษา",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40007",
				priority: "17",
				question: "7. การงานอาชีพ และเทคโนโลยี",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40008",
				priority: "18",
				question: "8. ศิลปะ",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
			{
				id: "098609d2-8f37-12ff-b6d1-700000c40009",
				priority: "19",
				question: "9. กลุ่มกิจกรรมพัฒนาผู้เรียน",
				type: "OPEN_END",
				detail: "",
				cf_section_id: "748609d2-8f37-44ff-b6d1-700001c00001"
			},
		]
		await queryInterface.bulkInsert("cfq_section", seedData)
	},

	down: async (queryInterface) => {
		await queryInterface.bulkDelete("cfq_section", {});
	}
}