module.exports = {
	up: async (queryInterface) => {
		seedData = [

			// ตอนที่  1  การตรวจสอบองค์ประกอบของหลักสูตรสถานศึกษา : กรอบสาระท้องถิ่น  มาตรฐานสากล 
			// จุดเน้นการจัดการศึกษาเพื่อการมีงานทำ 
			{
				id: "108609d2-8f37-44ff-b6d1-000001c00001",
				question: 'แสดงความเชื่อมโยงระหว่างหลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช  2551 และฉบับปรับปรุง พ.ศ.  2560 กรอบหลักสูตรระดับท้องถิ่น จุดเน้น และความต้องการของโรงเรียน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000002c00001",
				question: '1.2.1  แสดงภาพอนาคตของผู้เรียนที่สอดคล้องกับวิสัยทัศน์ของหลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช  2551  ประเทศไทย 4.0  โลกในศตวรรษที่  21 และทัดเทียมกับนานาชาติ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000002c00002",
				question: '1.2.2  แสดงภาพอนาคตของผู้เรียนสอดคล้องกับกรอบหลักสูตรระดับท้องถิ่น',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000002c00003",
				question: '1.2.3 แสดงภาพอนาคตของผู้เรียน ครอบคลุมสภาพความต้องการของโรงเรียน ชุมชน ท้องถิ่น ฯลฯ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000002c00004",
				question: '1.2.4   มีความชัดเจน สามารถปฏิบัติได้',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000003c00001",
				question: 'มีความสอดคล้องกับหลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช  2551',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00003"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000004c00001",
				question: '1.4.1 มีความสอดคล้องกับหลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช  2551',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00004"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000004c00002",
				question: '1.4.2 มีความสอดคล้องกับเป้าหมายและจุดเน้นของกรอบหลักสูตรระดับท้องถิ่น และโรงเรียน เช่น โรงเรียนในเขตพื้นที่พิเศษ โรงเรียนชายแดน โรงเรียนวัตถุประสงค์พิเศษฯลฯ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00004"
			},
			{
				id: "108609d2-8f37-44ff-b6d1-000004c00003",
				question: '1.4.3 สอดคล้องกับวิสัยทัศน์ของโรงเรียน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000001c00004"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000001c00001",
				question: '2.1.1  ระบุรายวิชาพื้นฐาน 8 กลุ่มสาระการเรียนรู้ตามหลักสูตรแกนการศึกษาขั้นพื้นฐาน จำแนกแต่ละชั้นปี / ช่วงชั้น (ม.ปลาย) อย่างชัดเจน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000001c00002",
				question: '2.1.2  บูรณาการกรอบสาระท้องถิ่นกับรายวิชาพื้นฐาน 8 กลุ่มสาระการเรียนรู้จำแนกแต่ละชั้นปี/   ช่วงชั้น (ม.ปลาย) อย่างชัดเจน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000001c00003",
				question: '2.1.3  บูรณการการจัดการศึกษาเพื่อการมีงานทำกับรายวิชาพื้นฐาน 8 กลุ่มสาระการเรียนรู้จำแนกแต่ละชั้นปี / ช่วงชั้น (ม.ปลาย) อย่างชัดเจน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000002c00001",
				question: '2.2.1  มีระบุรายวิชาเพิ่มเติม จำแนกแต่ละชั้นปี / ช่วงชั้น (ม.ปลาย) อย่างชัดเจน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000002c00002",
				question: '2.2.2 มีระบุรายวิชาเพิ่มเติม Independent Study : IS',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000002c00003",
				question: '2.2.3  มีระบุรายวิชาเพื่อการมีงานทำ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000002c00004",
				question: '2.2.4 มีระบุรายวิชาตามความสนใจของนักเรียน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00002"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000003c00001",
				question: '2.3.1 มีการระบุรายวิชาพื้นฐานทั้ง 8 กลุ่มสาระการเรียนรู้ พร้อมทั้งระบุเวลาเรียนและ/หรือหน่วยกิต',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000003c00002",
				question: '2.3.2 มีการระบุรายวิชาเพิ่มเติมที่สถานศึกษา กำหนด พร้อมทั้งระบุเวลาเรียนและ/หรือหน่วยกิต',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000003c00003",
				question: '2.3.3  มีการระบุกิจกรรมพัฒนาผู้เรียน พร้อมทั้งระบุเวลาเรียนตามเกณฑ์ที่หลักสูตรแกนกลางการศึกษาขั้นพื้นฐาน พุทธศักราช  2551 ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000003c00004",
				question: '2.3.4  มีรายวิชาพื้นฐานและรายวิชาเพิ่มเติมที่ระบุรหัสวิชาและชื่อรายวิชา ไว้อย่างถูกต้องชัดเจน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00003"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000003c00005",
				question: '2.3.5  มีรายวิชาเพิ่มเติม/กิจกรรมเพิ่มเติม สอดคล้องกับวิสัยทัศน์และจุดเน้นของโรงเรียน ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000002c00003"
			},
			// 4.1 โรงเรียนได้สนับสนุนและส่งเสริมให้ครูจัดกิจกรรมการเรียนรู้สะเต็มศึกษา (STEM Education) ในกลุ่มสาระการเรียนรู้ใดบ้าง
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00001",
				question: 'วิทยาศาสตร์',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00002",
				question: 'คณิตศาสตร์',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00003",
				question: 'ภาษาไทย',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00004",
				question: 'ศิลปะ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00005",
				question: 'สังคมศึกษาฯ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00006",
				question: 'สุขศึกษาและพลศึกษา',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00007",
				question: 'การงานอาชีพ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00008",
				question: 'ภาษาต่างประเทศ',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
			{
				id: "108609d2-8f37-44ff-b6d2-000004c00009",
				question: 'กิจกรรมพัฒนาผู้เรียน',
				type: "BOOLEAN",
				detail: "",
				cf_sub_section_id: "848609d2-8f37-44ff-b6d1-000004c00001"
			},
		]
		await queryInterface.bulkInsert('cfq_sub_section', seedData)
	},

	down: async (queryInterface) => {
		await queryInterface.bulkDelete('cfq_sub_section', {});
	}
}