module.exports = {
	up: async (queryInterface) => {
		seedData = [
			// 1.3 แบบนิเทศ ติดตามการจัดการเรียนการสอนรายวิชาวิทยาการคำนวณ ออกแบบเทคโนโลยี และรายวิชาเกี่ยวข้องกับหุ่นยนต์
		
			{
				id: "15140938-0aaf-4b79-87d0-50781132c001",
				priority: "1",
				question: "1. โรงเรียนมีนโยบายและระบบการดำเนินการจัดการขยะและลดปริมาณขยะในโรงเรียน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c002",
				priority: "2",
				question: "2. การจัดการด้านการใช้พลังงานในโรงเรียน low carbon school ของโรงเรียนลดใช้พลังงาน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c003",
				priority: "3",
				question: "3. การจัดการด้านการใช้น้ำและน้ำทิ้งในโรงเรียน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c004",
				priority: "4",
				question: "4. การจัดซื้อ/การใช้ผลิตภัณฑ์ และการจัดการขยะในโรงเรียน ",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c005",
				priority: "5",
				question: "5. สภาพแวดล้อมและภูมิทัศน์ที่เอื้อต่อการเรียนรู้ ด้านการอนุรักษ์พลังงาน และสิ่งแวดล้อม",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c006",
				priority: "6",
				question: "6. โรงเรียนมีการบูรณาการความรู้ด้านการอนุรักษ์พลังงานและสิ่งแวดล้อมในหลักสูตรและกระบวนการเรียนการสอน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c007",
				priority: "7",
				question: "7. โรงเรียนมีการขยายผลการดำเนินงานด้านอนุรักษ์พลังงานและสู่การจัดการขยะและลดปริมาณขยะในโรงเรียนใกล้เคียงและชุมชน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c008",
				priority: "8",
				question: "8. บุคลากรครูในโรงเรียนรับทราบเกี่ยวกับนโยบายอนุรักษ์พลังงานและการจัดการขยะและลดปริมาณขยะในโรงเรียน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c009",
				priority: "9",
				question: "9. บุคลากรอื่นๆ เช่นนักกาภารโรง ผู้จำหน่ายอาหารในโรงเรียน ฯลฯ รับทราบเกี่ยวกับนโยบายอนุรักษ์พลังงานและการจัดการขยะและลดปริมาณขยะในโรงเรียน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c010",
				priority: "10",
				question: "10. นักเรียนรับทราบเกี่ยวกับนโยบายอนุรักษ์พลังงานและการจัดการขยะและลดปริมาณขยะในโรงเรียน",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c011",
				priority: "11",
				question: "11. โรงเรียนมีมาตรการลดการใช้โฟม และถุงพลาสติก ",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
			{
				id: "15140938-0aaf-4b79-87d0-50781132c012",
				priority: "12",
				question: "12. โรงเรียนมีการจัดการและคัดแยกขยะตามแนวคิด 3Rs Reduce Reuse Recycle ",
				supervision_form_id: "d2494a78-a8a6-40a8-a6ce-64b12982cf11",
			},
		]
		await queryInterface.bulkInsert('qf', seedData)
	},

	down: async (queryInterface) => {
		await queryInterface.bulkDelete('qf', {});
	}
}